
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 3 to destroy.</code></pre>

* Replace
  * module.sscs-hearings-event-queue.azurerm_servicebus_queue.servicebus_queue
  * module.sscs-hearings-event-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.sscs-hearings-event-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.sscs-hearings-event-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/queues/tribunals-to-hearing-api-aat" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
      ~ name                                    = "tribunals-to-hearing-api-aat" -> "tribunals-to-hearings-api-aat" # forces replacement
        # (14 unchanged attributes hidden)
    }

  # module.sscs-hearings-event-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/queues/tribunals-to-hearing-api-aat/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/queues/tribunals-to-hearing-api-aat" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.sscs-hearings-event-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/queues/tribunals-to-hearing-api-aat/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/queues/tribunals-to-hearing-api-aat" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":3168,"Program":"tfcmt","SHA1":"","Vars":{}} -->